[{
  "_id": {
    "$oid": "667845cdb9cb890eef867133"
  },
  "author": "Prof. Kishore Das",
  "title": "Let's Grow",
  "category": "Personal",
  "slug": "Lets grow",
  "descr": "Any time we spend more time with someone, our relationship becomes more intimate. We get to know someone better, and we get a sense of what they want from us and for us without them having to explicitly say what that is. The more we grow in the knowledge of God, the more we have a clearer understanding of what He wants us to do to bring glory to Him.",
  "img": "https://newbreak.church/wp-content/uploads/2024/05/ticsucsxms4-1024x683.jpg"
},
{
  "_id": {
    "$oid": "668912ea2ad253743fc89b24"
  },
  "title": "The Future of AI in Healthcare",
  "category": "Techworld",
  "slug": "The Future of AI in Healthcare",
  "descr": "Artificial Intelligence (AI) is revolutionizing the healthcare industry by improving diagnostics, personalizing treatment plans, and automating administrative tasks. AI algorithms can analyze vast amounts of medical data to identify patterns and predict patient outcomes with remarkable accuracy. From AI-powered imaging tools that detect diseases early to virtual health assistants that provide patient support, the future of healthcare is poised to become more efficient and effective. This blog explores the current applications of AI in healthcare and what the future holds..",
  "img": "https://img.freepik.com/free-vector/ai-technology-microchip-background-vector-digital-transformation-concept_53876-112222.jpg?w=740&t=st=1720260365~exp=1720260965~hmac=26f30eab1eec4a22d1a0440acd4b511939081aa01ce0e8600e5b5269f0fe238d"
},
{
  "_id": {
    "$oid": "668914be2ad253743fc89b26"
  },
  "title": "The Gospel and Baseball",
  "category": "Sports",
  "slug": "The Gospel and Baseball",
  "descr": "15 When they had eaten breakfast, Jesus asked Simon Peter, “Simon, son of John,[g] do you love me more than these?” “Yes, Lord,” he said to him, “you know that I love you.” “Feed my lambs,” he told him.A second time he asked him, “Simon, son of John, do you love me?” “Yes, Lord,” he said to him, “you know that I love you.” “Shepherd my sheep,” he told him.He asked him the third time, “Simon, son of John, do you love me?” Peter was grieved that he asked him the third time, “Do you love me?” He said, “Lord, you know everything; you know that I love you.” “Feed my sheep,” Jesus said. “Truly I tell you, when you were younger, you would tie your belt and walk wherever you wanted. But when you grow old, you will stretch out your hands and someone else will tie you and carry you where you don’t want to go.” 19 He said this to indicate by what kind of death Peter would glorify God. After saying this, he told him, “Follow me.”.",
  "img": "https://newbreak.church/wp-content/uploads/2024/04/vohpkm7ruoq-1024x819.jpg"
},
{
  "_id": {
    "$oid": "6689802a2ad253743fc89b28"
  },
  "title": "You Are Under Construction",
  "category": "World",
  "slug": "You Are Under Construction",
  "descr": "Paul used two metaphors to explain what it means to continue to walk in Jesus. The first metaphor of their faith in Christ was to be “rooted” in Christ. Using an agricultural metaphor of plant growth, Paul reminded them that the basis of their faith, the life that would propel them forward, was found in Jesus. Christ was the source of their strength, spiritual vitality, and ability to please God. He was under the surface in their spiritual lives, nourishing them and helping them to become all that God had for them.",
  "img": "https://newbreak.church/wp-content/uploads/2024/06/t5yuohw6zro-1024x683.jpg"
},
{
  "_id": {
    "$oid": "668981032ad253743fc89b29"
  },
  "title": "When You’re Disconnecting from God",
  "category": "Personal",
  "slug": "When You’re Disconnecting from God",
  "descr": "There have been seasons where as soon as I start my day, I begin thinking about what I emails I need to respond to, and the people I need to call back, and the projects I need to finish, and the friends I need to catch up with, and the spouse that I need to show some attention to, and the lunches that need to be packed, and the bills that need to be paid, and somewhere in there I need to take care of my own mental health, physical health, emotional health but I also need to make sure dinner is ready, and that my dog gets walked, is the laundry done, is project complete, did I send those final emails…and the cycle goes on and on.And now at this point I feel overwhelmed, burdened and begin questioning “God, where are you in all of this?!”I wonder if God looks at us and says, “No, where are YOU? I’ve been here this whole time, waiting for you.”Because not ONCE did I even think about, let alone rely on God. I got so busy with life and doing things all on my own and I found myself disconnected from Jesus.Jesus actually talks specifically to when we find ourselves DISCONNECTED from God. Not on purpose, but because life has found us in a season where we’ve drifted. When He gives His final “I AM” statement in John 15, it’s one that deals directly with our relationship with Him…and here’s what I learned in studying it.",
  "img": "https://newbreak.church/wp-content/uploads/2024/03/nvlcsizedm0-1024x644.jpg"
},
{
  "_id": {
    "$oid": "668981bc2ad253743fc89b2a"
  },
  "title": "What the Wind and the Holy Spirit Have in Common (and Why it Matters!)",
  "category": "Personal",
  "slug": "What the Wind and the Holy Spirit Have in Common (and Why it Matters!)",
  "descr": "Are you the kind of person who is willing to go wherever the wind takes you? Maybe, as Christ-followers, we should all be! Look at what Jesus says to the middle of his memorable conversation with Nicodemus:John 3:7–8 (CSB) 'Do not be amazed that I told you that you must be born again. The wind [pneuma] blows where it pleases, and you hear its sound, but you don’t know where it comes from or where it is going. So it is with everyone born of the Spirit [pneuma].”The New Testament was written in Greek and the Greek word for wind pneuma is also the same word for spirit! (Interestingly, Hebrew is the same way, as the same word renders both 'wind' and 'spirit.') In context, Jesus is trying to explain to Nicodemus how we can be 'born again' (John 3:3 & 5). Utilizing a fun wordplay, he compares the wind to the Holy Spirit.",
  "img": "https://newbreak.church/wp-content/uploads/2024/02/hs5clnqbcoc-1024x683.jpg"
},
{
  "_id": {
    "$oid": "66898a0177380282bb7971a8"
  },
  "title": "Jesus at the Center",
  "category": "Religious ",
  "slug": "Jesus at the Center",
  "descr": "Christ came to show us who God is in a way that our minds and hearts could understand. He came to show us by His own experience that He understands us and what we’re going through, and He wants a relationship with us. The Almighty God, El Shaddai, came to show Himself to the world through the physical person of Jesus Christ, never once diminishing who He is as God.",
  "img": "https://newbreak.church/wp-content/uploads/2024/05/kfvmyjk6hz8-1024x701.jpg",
  "createdAt": {
    "$date": "2024-07-06T18:16:33.966Z"
  },
  "updatedAt": {
    "$date": "2024-07-06T18:16:33.966Z"
  },
  "__v": 0
}]